YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_DCM.h
#define DCM_DCMSRR_DCMDCFF5_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF5_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF5_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF5(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF5_SHIFT)) & DCM_DCMSRR_DCMDCFF5_MASK)

#define DCM_DCMSRR_DCMESF5_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF5_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF5_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF5(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF5_SHIFT)) & DCM_DCMSRR_DCMESF5_MASK)

#define DCM_DCMSRR_DCMESD5_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD5_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD5_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD5(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD5_SHIFT)) & DCM_DCMSRR_DCMESD5_MASK)

#define DCM_DCMSRR_DCMDCFT5_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT5_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT5_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT5(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT5_SHIFT)) & DCM_DCMSRR_DCMDCFT5_MASK)

#define DCM_DCMSRR_DCMDCFE6_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE6_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE6_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE6_SHIFT)) & DCM_DCMSRR_DCMDCFE6_MASK)

#define DCM_DCMSRR_DCMDCFF6_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF6_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF6_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF6_SHIFT)) & DCM_DCMSRR_DCMDCFF6_MASK)

#define DCM_DCMSRR_DCMESF6_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF6_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF6_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF6(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF6_SHIFT)) & DCM_DCMSRR_DCMESF6_MASK)

#define DCM_DCMSRR_DCMESD6_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD6_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD6_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD6(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD6_SHIFT)) & DCM_DCMSRR_DCMESD6_MASK)

#define DCM_DCMSRR_DCMDCFT6_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT6_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT6_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT6_SHIFT)) & DCM_DCMSRR_DCMDCFT6_MASK)

#define DCM_DCMSRR_DCMDCFE7_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE7_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE7_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE7_SHIFT)) & DCM_DCMSRR_DCMDCFE7_MASK)

#define DCM_DCMSRR_DCMDCFF7_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF7_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF7_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF7_SHIFT)) & DCM_DCMSRR_DCMDCFF7_MASK)

#define DCM_DCMSRR_DCMESF7_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF7_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF7_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF7(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF7_SHIFT)) & DCM_DCMSRR_DCMESF7_MASK)

#define DCM_DCMSRR_DCMESD7_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD7_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD7_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD7(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD7_SHIFT)) & DCM_DCMSRR_DCMESD7_MASK)

#define DCM_DCMSRR_DCMDCFT7_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT7_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT7_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT7_SHIFT)) & DCM_DCMSRR_DCMDCFT7_MASK)

#define DCM_DCMSRR_DCMDCFE8_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE8_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE8_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE8_SHIFT)) & DCM_DCMSRR_DCMDCFE8_MASK)

#define DCM_DCMSRR_DCMDCFF8_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF8_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF8_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF8_SHIFT)) & DCM_DCMSRR_DCMDCFF8_MASK)

#define DCM_DCMSRR_DCMESF8_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF8_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF8_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF8(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF8_SHIFT)) & DCM_DCMSRR_DCMESF8_MASK)

#define DCM_DCMSRR_DCMESD8_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD8_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD8_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD8(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD8_SHIFT)) & DCM_DCMSRR_DCMESD8_MASK)

#define DCM_DCMSRR_DCMDCFT8_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT8_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT8_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT8_SHIFT)) & DCM_DCMSRR_DCMDCFT8_MASK)

#define DCM_DCMSRR_DCMDCFE9_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE9_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE9_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE9(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE9_SHIFT)) & DCM_DCMSRR_DCMDCFE9_MASK)

#define DCM_DCMSRR_DCMDCFF9_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF9_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF9_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF9(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF9_SHIFT)) & DCM_DCMSRR_DCMDCFF9_MASK)

